[
  {
    "title": "Welcome To Spirogen!",
    "text": "This tutorial will guide you through the interface. You can access this tutorial at any time by finding it in the help section of the menu bar. \nClick next to start the tutorial!",
    "image": "TutorialWelcome.gif"
  },
  {
    "title": "The Pattern Tab",
    "text": "This is the Pattern tab. Here you'll find all of the controls that determine the shape of the drawing.",
    "image": "PatternTabTut1.png"
  },
  {
    "title": "Selecting a Pattern Type",
    "text": "There are a few different pattern types available. Use this menu to select the type.",
    "image": "PatternTabTut2.png"
  },
  {
    "title": "Patern Parameters",
    "text": "This area holds the parameters that determine the form of the drawing. You'll find things like angle of rotation and pen size here.",
    "image": "PatternTabTut3.png"
  },
  {
    "title": "Drawing the Pattern",
    "text": "- Click the run button to see the pattern drawn. \n- The drawing will be rendered using the values of the parameters on the page. \n- Once the drawing is complete, you can exit the drawing window if you wish.",
    "image": "PatternTabTut4.png"
  },
  {
    "title": "Loading & Saving",
    "text": "You can load or save patterns here. You can also find 'Open' and 'Save' options in the file menu.\n\n- Unfortunatly there is no way to save images directly, only the parameters that create the pattern are saved, so if you want to save the image, you'll have to take a screenshot.",
    "image": "PatternTabTut5.png"
  },
  {
    "title": "Loading",
    "text": "- To load a pattern, either type in the name, or click 'List Available' to get a list of existing settings. \n- Click Load once name is entered/selected. \n- You can load and save entire sessions, or color schemes and patterns individually. \n- Make sure to select the type you are trying to save.",
    "image": "LoadingTut1.gif"
  },
  {
    "title": "Tabs",
    "text": "You can control the colors of the drawing in the Color Scheme tab. Lets take a look at the color controls there.",
    "image": "PatternTabTut6.png"
  },
  {
    "title": "The Color Scheme Tab",
    "text": "This is the color scheme control tab.\nYour selections here will determine the color of the drawing.",
    "image": "ColorSchemeTabTut0.png"
  },
  {
    "title": "Pattern Color Controls",
    "text": "This is the Pattern color area.\nThese controls determine the colors of the lines drawn.",
    "image": "ColorSchemeTabTut1.png"
  },
  {
    "title": "Background Color",
    "text": "This is the Background color section. Just a single RGB color.",
    "image": "ColorSchemeTabTut2.png"
  },
  {
    "title": "Effects Section",
    "text": "This is the Effects section.\n These transformations alter all of the colors in your pallete in a permanent way.\n\nNote: GoTo % values in the Ramp Lightness effect under 30% won't work well.",
    "image": "ColorSchemeTabTut3.png"
  },
  {
    "title": "Total Colors Control",
    "text": "This control determines the total number of 'inbetween' colors to render. \n\n- If you have half the total colors that you have layers/number-of-iterations set in the pattern tab, your color scheme will repeat twice.\n\n- If you have twice as many total colors as you have reps set in the pattern, you will only make it half way through your color scheme.\n\n- The more total colors, the more gradual the fade from one color to the next.",
    "image": "ColorSchemeTabTut4.png"
  },
  {
    "title": "Main Color Controls",
    "text": "These are the most important color controls.\n\n- Number of stops defines how many colors you define explicitly.\n\n - These user-defined colors are spread evenly across the range of the number of total colors.\n\n- If you have only two stops, and set your total colors to 100, the pattern will start with the first defined color, and fade with 98 transition colors to the second color defined.\n\n- The shift control allows you to shift the position of the colors you have defined.\n\n- You have a bank of 11 colors total, and when you reduce your number of stops, you only reduce the number of colors you are currently using, and shifting will shift through the entire color set.\n\n- Load Default Colors will load a full-spectrum color set.\n\n- Reverse order reverses the order of the entire color bank, not just the currently selected color stops, so if you reverse, you may have to use the shift control to find your previous position.",
    "image": "ColorSchemeTabTut5.png"
  },
  {
    "title": "Number of Color Stops",
    "text": "This is the number of colors that you want to define explicitly to be spread out accross the range of total colors",
    "image": "NStops.gif"
  },
  {
    "title": "Color Shifting",
    "text": "This control shifts your current selection through all 11 of the colors in the colorbank.\n\nYou have 11 total colors in your color bank, but only the selection available will be used in the pattern.\n\nWhen you use the Ramp Lightness effect, it affects the entire color bank, so make use this control so that the edge that you want to be maximally affected is on one of the edges, and that you select that side in the effect menu.",
    "image": "ColorShift.gif"
  },
  {
    "title": "Hue Shifting (New Feature!)",
    "text": "You can shift the hue of all colors in your colorbank, rather than just their position in the bank, with the hue shift control.\n\nThe position of this control is not saved with the color scheme, so when you load a saved color set that has been hue shifted, the colors will still be the same as they were when you saved, but the shift hue control will be centered at 0.",
    "image": "HueShiftTut.gif"
  },
  {
    "title": "Updating Values",
    "text": "You can enter RGB values directly. RGB values must be between 0 and 255.",
    "image": "UpdateColors.gif"
  },
  {
    "title": "Editing Color Swatches Directly",
    "text": "Clicking on any color swatch will open up an editing dialog, where you can manipulate the individual channels of that color directly.\n\n- The swatches on the left of the dialog can be selected.\n\n- The coluumn of swatches on the left are the colors in your bank\n\n- The swatches in the right column are defaults, so the right and left columns will be exactly the same if you haven't edited any of your colors yet.\n\n- You can paste a hex color code into the hex box, and the color will be updated.",
    "image": "ColorEditDialog.gif"
  },
  {
    "title": "Using Effects",
    "text": "Clicking on an effect will open a dialog box.\n\n- Ramp Lightness and Shift Lightness both have an amount parameter. This etermines how much to shift the RGB values, and it should be between -255 and 255.\n\n- These effects are not reversable, so save your colors before using if you are attached to them!\n\n- Effects have a ceiling effect. Values will max at 255 and hit bottom at 0.\n\n- Ramp lightness takes a direction (left or right) which is the side of the color bank that will be affected more heavily. GoTo % is the percentage of the color bank that you want to adjust.\n\n- Ramp lightness ramps through the entire color bank, not your current selectiion, so make sure that you use the color shift and reverse functions to get the desired start or end point of your fade is on one of the edges.",
    "image": "EffectsTut.gif"
  },
  {
    "title": "Have Fun!",
    "text": "That's it for the tutorial! Enjoy the playground!\n\nThis tutorial will no longer open upon launch, but you can always find it in the Help section of the menu bar.",
    "image": "TutorialWelcome.gif"
  }
]